{"inkVersion":20,"root":[["^Part I: The Invitation","\n","^Hello X! We are delighted to announce after reviewing hundreds of applications, you’ve been selected to interview for a summer internship with V Inc. In the next day or so, one of our HR representatives will be calling you to schedule an interview date. In the mean time, we would like to encourage you to learn a little more about our company by watching the informational video below.","\n","^This video provides an overview about our summer internship program, and the company as a whole. Thank you and we look forward to meeting you very soon!","\n","ev","str","^Watch the video","/str","/ev",{"*":"0.c-0","flg":20},{"c-0":["^ [I started watching the video.]","\n","^[intro music with voice over]: Hello, I’m Emily Jacobs, Director of the Summer Internship Program at V-Inc. First, I’d like to say congratulations on making it this far in the interview process. This makes you just one of 50 applicants to make it through our highly rigorous and selective process! I want to welcome you to a brief introduction to our company, V-Inc.","\n","^V-Inc has been an innovative company since its inception in 1999, when it started out as a company providing I.T. training.  It eventually evolved to software development, focusing initially on customized software, and today V-Inc is a 800 Billion dollar global corporation with an unrivaled portfolio of end to end cutting edge solutions and services from software product development, to block-chain technologies and other smart contract related products. Ushering businesses into a new era of technology is what we do best at V-Inc. This is our mission.","\n","^At V Inc we have the ability to make more of an impact on people and more of a change in one year than many people do in their lifetimes. The technology landscape is ever-changing. Six months can be the difference between obsolete and contemporary. Thus, to maintain our leadership position as innovators within the industry, we constantly seek and source the most brilliant, creative and talented young minds to join the team here at V-Inc. The summer internship program gives us the opportunity to train the best and the brightest, to scout exceptional talent that we know will advance our mission to remain at the forefront of innovative technologies. We typically graduate interns identified as exceptional into permanent positions within the company.","\n",["ev","str","^Watch testimonials from previous interns","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Continue with the interview","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ [I'm now watching testimonials from interns.]","\n",[["ev",{"^->":"0.c-0.8.c-0.2.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Jake Maxwell (White guy #1, block chain data engineering intern)",{"->":"$r","var":true},null]}],["ev",{"^->":"0.c-0.8.c-0.2.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Paola Ortiz (Hispanic girl with accent, marketing intern)",{"->":"$r","var":true},null]}],["ev",{"^->":"0.c-0.8.c-0.2.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-2","flg":18},{"s":["^Connor McDermott (White guy #2, financial analyst intern)",{"->":"$r","var":true},null]}],["ev",{"^->":"0.c-0.8.c-0.2.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-3","flg":18},{"s":["^Zhang Wei (Asian girl, software engineering intern)",{"->":"$r","var":true},null]}],["ev",{"^->":"0.c-0.8.c-0.2.4.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-4","flg":18},{"s":["^Logan Stiles (White guy #3)",{"->":"$r","var":true},null]}],"ev","str","^Stop watching testimonials","/str","/ev",{"*":".^.c-5","flg":20},{"c-0":["ev",{"^->":"0.c-0.8.c-0.2.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n","^My name is Jake Maxwell, I’m a graduate intern here at V Inc. Just the process of coding is actually fun. It’s exciting to work at V inc because unlike a lot of other tech companies, V Inc is on the cutting edge of developing block chain technologies, which is revolutionizing the way smart contracts are executed. Block chain is the future and V-Inc is literally the rocket that’s taking us there.","\n",["ev","str","^Return to selection screen","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ","\n",{"->":".^.^.^.^.^"},{"->":"0.g-0"},{"#f":5}]}],{"#f":5}],"c-1":["ev",{"^->":"0.c-0.8.c-0.2.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^My name is Paola Ortiz. I go to the University of Denver and I study Marketing and communications. When I was young, I just looooved the jingles to commercials; I used to memorize TV commercials and act them out. It always fascinated me how one could see the beauty in every day things, and make others see that same beauty by playing with words.","\n",["ev","str","^Return to selection screen","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ","\n",{"->":".^.^.^.^.^"},{"->":"0.g-0"},{"#f":5}]}],{"#f":5}],"c-2":["ev",{"^->":"0.c-0.8.c-0.2.c-2.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],"\n","^I’m Connor McDermott. I study Financial Mathematics at the Massachusetts Institute of Technology. I’m Interning here as a financial analyst and having the time of my life learning about equity options and pricing V Inc stock for the financial markets.","\n","^Mathematics is beautiful. She is everywhere and in everything- take the Fibonacci sequence in nature, for example! I think if mathematics was a person I’d marry her! Getting up everyday to do what I love, with a super talented team at V-Inc is beyond the dream. Life couldn’t get any better for me.","\n",["ev","str","^Return to selection screen","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ","\n",{"->":".^.^.^.^.^"},{"->":"0.g-0"},{"#f":5}]}],{"#f":5}],"c-3":["ev",{"^->":"0.c-0.8.c-0.2.c-3.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],"\n","^My name is Zhang Wei and I’m from New Haven, Connecticut, where I’m studying physics and computer science at Yale University. I’m an intern in the software engineering department at V Inc, where I’ve had the opportunity to work with so many leaders in the field. The mentorship has been nothing short of amazing; My coding skills have gone through the roof in such a short time and I’m currently working on writing my own code for a software program to improve technical interviewing in the tech industry. This is my greatest accomplishment yet and I’m excited to be part of the team.","\n",["ev","str","^Return to selection screen","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ","\n",{"->":".^.^.^.^.^"},{"->":"0.g-0"},{"#f":5}]}],{"#f":5}],"c-4":["ev",{"^->":"0.c-0.8.c-0.2.c-4.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.4.s"},[{"#n":"$r2"}],"\n","^My name is Zhang Wei and I’m from New Haven, Connecticut, where I’m studying physics and computer science at Yale University. I’m an intern in the software engineering department at V Inc, where I’ve had the opportunity to work with so many leaders in the field. The mentorship has been nothing short of amazing; My coding skills have gone through the roof in such a short time and I’m currently working on writing my own code for a software program to improve technical interviewing in the tech industry. This is my greatest accomplishment yet and I’m excited to be part of the team.","\n",["ev","str","^Return to selection screen","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ","\n",{"->":".^.^.^.^.^"},{"->":"0.g-0"},{"#f":5}]}],{"#f":5}],"c-5":["^ [I stopped watching testimonials.]","\n",{"->":"0.c-0.8.c-1"},{"->":"0.g-0"},{"#f":5}]}],{"#f":5}],"c-1":["^ [I decided to continue with the interview.]","\n","^On this day X has been invited to the company’s campus for an interview. Her appointment is set for 2:30pm. She walks into the building and checks in at the security desk; There are two security guards (men) at the front door—one Black, another Hispanic. X checks in at the security desk. She presents her interview card, and states that she is interviewing with Division D.","\n","^Black Guard looks at her interview card and ID, checks her name on an ipad (or computer) and says: “10th Floor, Main reception area- right across the elevators.”","\n","^X goes through security and is allowed into the foyer. It’s exquisite —well decorated, people in suits (men, mostly) walking about hurriedly, minding their own business. There seems to be a sense of urgency in this work environment.","\n",["ev","str","^Head to the elevators","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ [I walked to the elevators.]","\n","^X heads to the elevator. A cleaning lady (White woman) walks by with a cleaning cart and says ‘Hello’ to X as she continues on her way.","\n",["ev","str","^Press the 10th floor button","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ [I pressed the 10th floor button.]","\n","^X takes the elevator to the 10th floor. Walks straight to the reception area and meets receptionist; a Black woman in her mid-thirties, with a short Afro.","\n","^Receptionist: Good afternoon and welcome to Division D. How may I help you?","\n","^X: [ this is free flow and X will have to state in her own words that she is there for the interview].","\n","^Receptionist: The admin assistant interviews were done an hour ago. And that would have been down the hall, Room 1015. Sorry.","\n","^X: [ states that she is here for the internship interview]","\n","^Receptionist:  OHHH! I’m so sorry…we’re hosting 2 interviews today and one just wrapped up. What’s your name sweetie?","\n","^X: X last name","\n","^Receptionist: Types into a computer. Makes small talk.","\n","^Wow! Engineering huh? You must be super smart [or a chop, or a genius]! Over 1000 applications each year for those positions and only about 10 make the final cut (she smiles at X).","\n","^Receptionist prints out a paper with a number on it.  Gives the paper to X.","\n","^OK. Your ticket number is D035. Go to the waiting area, room 1016-down the hall to your right-first door-- and wait for your number to be called over the intercom. The interview room will be RM 1018 directly opposite the waiting area. Shouldn’t be a long wait. Good luck.","\n",["ev","str","^Respond to the receptionist","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Don't respond to the receptionist","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ","\n",{"->":"0.g-0"},{"#f":5}],"c-1":["\n",{"->":"social_interaction_manipulation"},{"->":"0.g-0"},{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"social_interaction_manipulation":[[["end",{"#f":5,"#n":"g-0"}],null],{"#f":1}],"#f":1}],"listDefs":{}}